## [debugtest](https://daniellem97.app.spacelift.io/stack/debugtest/run/01JS1Z8HAVE4RJGESPJSCC85C8) plan logs

<details>
<summary>Click here to expand</summary>

```
[01JRZAME9R535650GHAZY8AEEJ] Planning changes with 0 custom hooks...
[01JRZAME9R535650GHAZY8AEEJ] Running command: sh [-c spacelift-worker env >> /mnt/workspace/.env_hooks_before && terraform plan -input=false -lock=false -out=spacelift.plan && spacelift-worker env >> /mnt/workspace/.env_hooks_after]
data.terraform_remote_state.demo-stack-state: Reading...
data.terraform_remote_state.demo-stack-state: Read complete after 0s
data.aws_ami.server_ami: Reading...
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-062e4d8f8d7ed6dbe]
data.aws_ami.server_ami: Read complete after 1s [id=ami-09563a10670fc573c]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-0699a5862888e7a28]
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-0a0e4b8f1d3298c81]
aws_security_group.mtc_sg: Refreshing state... [id=sg-04b56f557fb633a77]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-099674095dab8a4d3]
aws_route.default_route2: Refreshing state... [id=r-rtb-0a0e4b8f1d3298c811080289494]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-067c8a458804938fd]
aws_route.default_route: Refreshing state... [id=r-rtb-0a0e4b8f1d3298c811080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_internet_gateway.mtc_internet_gateway has been deleted
  - resource "aws_internet_gateway" "mtc_internet_gateway" {
      - id       = "igw-099674095dab8a4d3" -> null
        tags     = {
            "Name" = "mtc_igw2"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_route_table.mtc_public_rt has been deleted
  - resource "aws_route_table" "mtc_public_rt" {
      - id               = "rtb-0a0e4b8f1d3298c81" -> null
        tags             = {
            "Name" = "dev_public_rt"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_subnet.mtc_public_subnet has been deleted
  - resource "aws_subnet" "mtc_public_subnet" {
      - id                                             = "subnet-0699a5862888e7a28" -> null
        tags                                           = {
            "Repository" = "new2"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.mtc_internet_gateway will be created
  + resource "aws_internet_gateway" "mtc_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "mtc_igw2"
        }
      + tags_all = {
          + "Name" = "mtc_igw2"
        }
      + vpc_id   = "vpc-062e4d8f8d7ed6dbe"
    }

  # aws_route.default_route will be created
  + resource "aws_route" "default_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.default_route2 will be created
  + resource "aws_route" "default_route2" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.mtc_public_rt will be created
  + resource "aws_route_table" "mtc_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dev_public_rt"
        }
      + tags_all         = {
          + "Name" = "dev_public_rt"
        }
      + vpc_id           = "vpc-062e4d8f8d7ed6dbe"
    }

  # aws_route_table_association.mtc_public_assoc will be created
  + resource "aws_route_table_association" "mtc_public_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.mtc_sg will be created
  + resource "aws_security_group" "mtc_sg" {
      + arn                    = (known after apply)
      + description            = "public security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-062e4d8f8d7ed6dbe"
    }

  # aws_subnet.mtc_public_subnet will be created
  + resource "aws_subnet" "mtc_public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.123.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = *****
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Repository" = "new2"
        }
      + tags_all                                       = {
          + "Repository" = "new2"
        }
      + vpc_id                                         = "vpc-062e4d8f8d7ed6dbe"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - dev_ip1       = "test132" -> null
  + dev_ip4       = "test132"
[01JRZAME9R535650GHAZY8AEEJ] Changes are GO
[01JRZAME9R535650GHAZY8AEEJ] Running command: sh [-c terraform show -json]
[01JRZAME9R535650GHAZY8AEEJ] Uploading the list of managed resources...
[01JRZAME9R535650GHAZY8AEEJ] Running command: sh [-c terraform show -json "spacelift.plan"]
[01JRZAME9R535650GHAZY8AEEJ] Generating Infracost JSON report from plan
[01JRZAME9R535650GHAZY8AEEJ] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path /tmp/spacelift-plan382715378 --format=json --log-level=warn]

[01JRZAME9R535650GHAZY8AEEJ] Infracost report generated successfully
[01JRZAME9R535650GHAZY8AEEJ] Mapping Infracost data to resources
[01JRZAME9R535650GHAZY8AEEJ] Costs mapped successfully
[01JRZAME9R535650GHAZY8AEEJ] Running command: sh [-c terraform output -json]
[01JRZAME9R535650GHAZY8AEEJ] Please be aware that the run changes calculation includes output changes.
[01JRZAME9R535650GHAZY8AEEJ] Resource list upload is GO
[01JRZAME9R535650GHAZY8AEEJ] Generating JSON representation of the plan...
[01JRZAME9R535650GHAZY8AEEJ] Running command: sh [-c terraform show -json "spacelift.plan"]
[01JRZAME9R535650GHAZY8AEEJ] JSON representation is GO
[01JRZAME9R535650GHAZY8AEEJ] Generating Infracost JSON report from plan
[01JRZAME9R535650GHAZY8AEEJ] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path spacelift.plan.json --format=json --log-level=warn]

[01JRZAME9R535650GHAZY8AEEJ] Infracost report generated successfully
[01JRZAME9R535650GHAZY8AEEJ] Loading custom plan policy inputs...
[01JRZAME9R535650GHAZY8AEEJ] 0 custom plan policy inputs found
[01JRZAME9R535650GHAZY8AEEJ] No plan policies to evaluate
```

</details>